ycsb_logs/load.log
./test/benchmark/jre/jre1.8.0_471//bin/java  -classpath /root/asterinas/ycsb-0.17.0/conf:/root/asterinas/ycsb-0.17.0/lib/HdrHistogram-2.1.4.jar:/root/asterinas/ycsb-0.17.0/lib/core-0.17.0.jar:/root/asterinas/ycsb-0.17.0/lib/htrace-core4-4.1.0-incubating.jar:/root/asterinas/ycsb-0.17.0/lib/jackson-core-asl-1.9.4.jar:/root/asterinas/ycsb-0.17.0/lib/jackson-mapper-asl-1.9.4.jar:/root/asterinas/ycsb-0.17.0/redis-binding/lib/commons-pool2-2.4.2.jar:/root/asterinas/ycsb-0.17.0/redis-binding/lib/jedis-2.9.0.jar:/root/asterinas/ycsb-0.17.0/redis-binding/lib/redis-binding-0.17.0.jar site.ycsb.Client -load -db site.ycsb.db.RedisClient -P ./ycsb-0.17.0/workloads/workload-custom -p redis.host=10.0.2.15 -threads 1 -target 1000
[OVERALL], RunTime(ms), 2209
[OVERALL], Throughput(ops/sec), 679.040289723857
[TOTAL_GCS_PS_Scavenge], Count, 0
[TOTAL_GC_TIME_PS_Scavenge], Time(ms), 0
[TOTAL_GC_TIME_%_PS_Scavenge], Time(%), 0.0
[TOTAL_GCS_PS_MarkSweep], Count, 0
[TOTAL_GC_TIME_PS_MarkSweep], Time(ms), 0
[TOTAL_GC_TIME_%_PS_MarkSweep], Time(%), 0.0
[TOTAL_GCs], Count, 0
[TOTAL_GC_TIME], Time(ms), 0
[TOTAL_GC_TIME_%], Time(%), 0.0
[CLEANUP], Operations, 1
[CLEANUP], AverageLatency(us), 415.0
[CLEANUP], MinLatency(us), 415
[CLEANUP], MaxLatency(us), 415
[CLEANUP], 95thPercentileLatency(us), 415
[CLEANUP], 99thPercentileLatency(us), 415
[INSERT], Operations, 1500
[INSERT], AverageLatency(us), 130.166
[INSERT], MinLatency(us), 43
[INSERT], MaxLatency(us), 3909
[INSERT], 95thPercentileLatency(us), 306
[INSERT], 99thPercentileLatency(us), 607
[INSERT], Return=OK, 1500
./test/benchmark/jre/jre1.8.0_471//bin/java  -classpath /root/asterinas/ycsb-0.17.0/conf:/root/asterinas/ycsb-0.17.0/lib/HdrHistogram-2.1.4.jar:/root/asterinas/ycsb-0.17.0/lib/core-0.17.0.jar:/root/asterinas/ycsb-0.17.0/lib/htrace-core4-4.1.0-incubating.jar:/root/asterinas/ycsb-0.17.0/lib/jackson-core-asl-1.9.4.jar:/root/asterinas/ycsb-0.17.0/lib/jackson-mapper-asl-1.9.4.jar:/root/asterinas/ycsb-0.17.0/redis-binding/lib/commons-pool2-2.4.2.jar:/root/asterinas/ycsb-0.17.0/redis-binding/lib/jedis-2.9.0.jar:/root/asterinas/ycsb-0.17.0/redis-binding/lib/redis-binding-0.17.0.jar site.ycsb.Client -load -db site.ycsb.db.RedisClient -P ./ycsb-0.17.0/workloads/workload-custom -p redis.host=10.0.2.15 -threads 1 -target 1000 -p insertstart=64
[OVERALL], RunTime(ms), 1513
[OVERALL], Throughput(ops/sec), 991.4077990746861
[TOTAL_GCS_PS_Scavenge], Count, 0
[TOTAL_GC_TIME_PS_Scavenge], Time(ms), 0
[TOTAL_GC_TIME_%_PS_Scavenge], Time(%), 0.0
[TOTAL_GCS_PS_MarkSweep], Count, 0
[TOTAL_GC_TIME_PS_MarkSweep], Time(ms), 0
[TOTAL_GC_TIME_%_PS_MarkSweep], Time(%), 0.0
[TOTAL_GCs], Count, 0
[TOTAL_GC_TIME], Time(ms), 0
[TOTAL_GC_TIME_%], Time(%), 0.0
[CLEANUP], Operations, 1
[CLEANUP], AverageLatency(us), 275.0
[CLEANUP], MinLatency(us), 275
[CLEANUP], MaxLatency(us), 275
[CLEANUP], 95thPercentileLatency(us), 275
[CLEANUP], 99thPercentileLatency(us), 275
[INSERT], Operations, 1500
[INSERT], AverageLatency(us), 151.40466666666666
[INSERT], MinLatency(us), 37
[INSERT], MaxLatency(us), 3023
[INSERT], 95thPercentileLatency(us), 402
[INSERT], 99thPercentileLatency(us), 555
[INSERT], Return=OK, 1500
./test/benchmark/jre/jre1.8.0_471//bin/java  -classpath /root/asterinas/ycsb-0.17.0/conf:/root/asterinas/ycsb-0.17.0/lib/HdrHistogram-2.1.4.jar:/root/asterinas/ycsb-0.17.0/lib/core-0.17.0.jar:/root/asterinas/ycsb-0.17.0/lib/htrace-core4-4.1.0-incubating.jar:/root/asterinas/ycsb-0.17.0/lib/jackson-core-asl-1.9.4.jar:/root/asterinas/ycsb-0.17.0/lib/jackson-mapper-asl-1.9.4.jar:/root/asterinas/ycsb-0.17.0/redis-binding/lib/commons-pool2-2.4.2.jar:/root/asterinas/ycsb-0.17.0/redis-binding/lib/jedis-2.9.0.jar:/root/asterinas/ycsb-0.17.0/redis-binding/lib/redis-binding-0.17.0.jar site.ycsb.Client -load -db site.ycsb.db.RedisClient -P ./ycsb-0.17.0/workloads/workload-custom -p redis.host=10.0.2.15 -threads 1 -target 1000 -p insertstart=128
[OVERALL], RunTime(ms), 1510
[OVERALL], Throughput(ops/sec), 993.3774834437086
[TOTAL_GCS_PS_Scavenge], Count, 0
[TOTAL_GC_TIME_PS_Scavenge], Time(ms), 0
[TOTAL_GC_TIME_%_PS_Scavenge], Time(%), 0.0
[TOTAL_GCS_PS_MarkSweep], Count, 0
[TOTAL_GC_TIME_PS_MarkSweep], Time(ms), 0
[TOTAL_GC_TIME_%_PS_MarkSweep], Time(%), 0.0
[TOTAL_GCs], Count, 0
[TOTAL_GC_TIME], Time(ms), 0
[TOTAL_GC_TIME_%], Time(%), 0.0
[CLEANUP], Operations, 1
[CLEANUP], AverageLatency(us), 276.0
[CLEANUP], MinLatency(us), 276
[CLEANUP], MaxLatency(us), 276
[CLEANUP], 95thPercentileLatency(us), 276
[CLEANUP], 99thPercentileLatency(us), 276
[INSERT], Operations, 1500
[INSERT], AverageLatency(us), 88.60533333333333
[INSERT], MinLatency(us), 34
[INSERT], MaxLatency(us), 2381
[INSERT], 95thPercentileLatency(us), 199
[INSERT], 99thPercentileLatency(us), 307
[INSERT], Return=OK, 1500
./test/benchmark/jre/jre1.8.0_471//bin/java  -classpath /root/asterinas/ycsb-0.17.0/conf:/root/asterinas/ycsb-0.17.0/lib/HdrHistogram-2.1.4.jar:/root/asterinas/ycsb-0.17.0/lib/core-0.17.0.jar:/root/asterinas/ycsb-0.17.0/lib/htrace-core4-4.1.0-incubating.jar:/root/asterinas/ycsb-0.17.0/lib/jackson-core-asl-1.9.4.jar:/root/asterinas/ycsb-0.17.0/lib/jackson-mapper-asl-1.9.4.jar:/root/asterinas/ycsb-0.17.0/redis-binding/lib/commons-pool2-2.4.2.jar:/root/asterinas/ycsb-0.17.0/redis-binding/lib/jedis-2.9.0.jar:/root/asterinas/ycsb-0.17.0/redis-binding/lib/redis-binding-0.17.0.jar site.ycsb.Client -load -db site.ycsb.db.RedisClient -P ./ycsb-0.17.0/workloads/workload-custom -p redis.host=10.0.2.15 -threads 1 -target 1000 -p insertstart=192
[OVERALL], RunTime(ms), 1510
[OVERALL], Throughput(ops/sec), 993.3774834437086
[TOTAL_GCS_PS_Scavenge], Count, 0
[TOTAL_GC_TIME_PS_Scavenge], Time(ms), 0
[TOTAL_GC_TIME_%_PS_Scavenge], Time(%), 0.0
[TOTAL_GCS_PS_MarkSweep], Count, 0
[TOTAL_GC_TIME_PS_MarkSweep], Time(ms), 0
[TOTAL_GC_TIME_%_PS_MarkSweep], Time(%), 0.0
[TOTAL_GCs], Count, 0
[TOTAL_GC_TIME], Time(ms), 0
[TOTAL_GC_TIME_%], Time(%), 0.0
[CLEANUP], Operations, 1
[CLEANUP], AverageLatency(us), 299.0
[CLEANUP], MinLatency(us), 299
[CLEANUP], MaxLatency(us), 299
[CLEANUP], 95thPercentileLatency(us), 299
[CLEANUP], 99thPercentileLatency(us), 299
[INSERT], Operations, 1500
[INSERT], AverageLatency(us), 116.84333333333333
[INSERT], MinLatency(us), 36
[INSERT], MaxLatency(us), 2867
[INSERT], 95thPercentileLatency(us), 300
[INSERT], 99thPercentileLatency(us), 376
[INSERT], Return=OK, 1500
./test/benchmark/jre/jre1.8.0_471//bin/java  -classpath /root/asterinas/ycsb-0.17.0/conf:/root/asterinas/ycsb-0.17.0/lib/HdrHistogram-2.1.4.jar:/root/asterinas/ycsb-0.17.0/lib/core-0.17.0.jar:/root/asterinas/ycsb-0.17.0/lib/htrace-core4-4.1.0-incubating.jar:/root/asterinas/ycsb-0.17.0/lib/jackson-core-asl-1.9.4.jar:/root/asterinas/ycsb-0.17.0/lib/jackson-mapper-asl-1.9.4.jar:/root/asterinas/ycsb-0.17.0/redis-binding/lib/commons-pool2-2.4.2.jar:/root/asterinas/ycsb-0.17.0/redis-binding/lib/jedis-2.9.0.jar:/root/asterinas/ycsb-0.17.0/redis-binding/lib/redis-binding-0.17.0.jar site.ycsb.Client -load -db site.ycsb.db.RedisClient -P ./ycsb-0.17.0/workloads/workload-custom -p redis.host=10.0.2.15 -threads 1 -target 1000 -p insertstart=256
[OVERALL], RunTime(ms), 1508
[OVERALL], Throughput(ops/sec), 994.6949602122016
[TOTAL_GCS_PS_Scavenge], Count, 0
[TOTAL_GC_TIME_PS_Scavenge], Time(ms), 0
[TOTAL_GC_TIME_%_PS_Scavenge], Time(%), 0.0
[TOTAL_GCS_PS_MarkSweep], Count, 0
[TOTAL_GC_TIME_PS_MarkSweep], Time(ms), 0
[TOTAL_GC_TIME_%_PS_MarkSweep], Time(%), 0.0
[TOTAL_GCs], Count, 0
[TOTAL_GC_TIME], Time(ms), 0
[TOTAL_GC_TIME_%], Time(%), 0.0
[CLEANUP], Operations, 1
[CLEANUP], AverageLatency(us), 396.0
[CLEANUP], MinLatency(us), 396
[CLEANUP], MaxLatency(us), 396
[CLEANUP], 95thPercentileLatency(us), 396
[CLEANUP], 99thPercentileLatency(us), 396
[INSERT], Operations, 1500
[INSERT], AverageLatency(us), 137.968
[INSERT], MinLatency(us), 36
[INSERT], MaxLatency(us), 2595
[INSERT], 95thPercentileLatency(us), 369
[INSERT], 99thPercentileLatency(us), 546
[INSERT], Return=OK, 1500
./test/benchmark/jre/jre1.8.0_471//bin/java  -classpath /root/asterinas/ycsb-0.17.0/conf:/root/asterinas/ycsb-0.17.0/lib/HdrHistogram-2.1.4.jar:/root/asterinas/ycsb-0.17.0/lib/core-0.17.0.jar:/root/asterinas/ycsb-0.17.0/lib/htrace-core4-4.1.0-incubating.jar:/root/asterinas/ycsb-0.17.0/lib/jackson-core-asl-1.9.4.jar:/root/asterinas/ycsb-0.17.0/lib/jackson-mapper-asl-1.9.4.jar:/root/asterinas/ycsb-0.17.0/redis-binding/lib/commons-pool2-2.4.2.jar:/root/asterinas/ycsb-0.17.0/redis-binding/lib/jedis-2.9.0.jar:/root/asterinas/ycsb-0.17.0/redis-binding/lib/redis-binding-0.17.0.jar site.ycsb.Client -load -db site.ycsb.db.RedisClient -P ./ycsb-0.17.0/workloads/workload-custom -p redis.host=10.0.2.15 -threads 1 -target 1000 -p insertstart=320
[OVERALL], RunTime(ms), 1510
[OVERALL], Throughput(ops/sec), 993.3774834437086
[TOTAL_GCS_PS_Scavenge], Count, 0
[TOTAL_GC_TIME_PS_Scavenge], Time(ms), 0
[TOTAL_GC_TIME_%_PS_Scavenge], Time(%), 0.0
[TOTAL_GCS_PS_MarkSweep], Count, 0
[TOTAL_GC_TIME_PS_MarkSweep], Time(ms), 0
[TOTAL_GC_TIME_%_PS_MarkSweep], Time(%), 0.0
[TOTAL_GCs], Count, 0
[TOTAL_GC_TIME], Time(ms), 0
[TOTAL_GC_TIME_%], Time(%), 0.0
[CLEANUP], Operations, 1
[CLEANUP], AverageLatency(us), 272.0
[CLEANUP], MinLatency(us), 272
[CLEANUP], MaxLatency(us), 272
[CLEANUP], 95thPercentileLatency(us), 272
[CLEANUP], 99thPercentileLatency(us), 272
[INSERT], Operations, 1500
[INSERT], AverageLatency(us), 95.22533333333334
[INSERT], MinLatency(us), 36
[INSERT], MaxLatency(us), 2451
[INSERT], 95thPercentileLatency(us), 218
[INSERT], 99thPercentileLatency(us), 310
[INSERT], Return=OK, 1500
./test/benchmark/jre/jre1.8.0_471//bin/java  -classpath /root/asterinas/ycsb-0.17.0/conf:/root/asterinas/ycsb-0.17.0/lib/HdrHistogram-2.1.4.jar:/root/asterinas/ycsb-0.17.0/lib/core-0.17.0.jar:/root/asterinas/ycsb-0.17.0/lib/htrace-core4-4.1.0-incubating.jar:/root/asterinas/ycsb-0.17.0/lib/jackson-core-asl-1.9.4.jar:/root/asterinas/ycsb-0.17.0/lib/jackson-mapper-asl-1.9.4.jar:/root/asterinas/ycsb-0.17.0/redis-binding/lib/commons-pool2-2.4.2.jar:/root/asterinas/ycsb-0.17.0/redis-binding/lib/jedis-2.9.0.jar:/root/asterinas/ycsb-0.17.0/redis-binding/lib/redis-binding-0.17.0.jar site.ycsb.Client -load -db site.ycsb.db.RedisClient -P ./ycsb-0.17.0/workloads/workload-custom -p redis.host=10.0.2.15 -threads 1 -target 1000 -p insertstart=384
[OVERALL], RunTime(ms), 1510
[OVERALL], Throughput(ops/sec), 993.3774834437086
[TOTAL_GCS_PS_Scavenge], Count, 0
[TOTAL_GC_TIME_PS_Scavenge], Time(ms), 0
[TOTAL_GC_TIME_%_PS_Scavenge], Time(%), 0.0
[TOTAL_GCS_PS_MarkSweep], Count, 0
[TOTAL_GC_TIME_PS_MarkSweep], Time(ms), 0
[TOTAL_GC_TIME_%_PS_MarkSweep], Time(%), 0.0
[TOTAL_GCs], Count, 0
[TOTAL_GC_TIME], Time(ms), 0
[TOTAL_GC_TIME_%], Time(%), 0.0
[CLEANUP], Operations, 1
[CLEANUP], AverageLatency(us), 351.0
[CLEANUP], MinLatency(us), 351
[CLEANUP], MaxLatency(us), 351
[CLEANUP], 95thPercentileLatency(us), 351
[CLEANUP], 99thPercentileLatency(us), 351
[INSERT], Operations, 1500
[INSERT], AverageLatency(us), 115.672
[INSERT], MinLatency(us), 37
[INSERT], MaxLatency(us), 2617
[INSERT], 95thPercentileLatency(us), 290
[INSERT], 99thPercentileLatency(us), 460
[INSERT], Return=OK, 1500
./test/benchmark/jre/jre1.8.0_471//bin/java  -classpath /root/asterinas/ycsb-0.17.0/conf:/root/asterinas/ycsb-0.17.0/lib/HdrHistogram-2.1.4.jar:/root/asterinas/ycsb-0.17.0/lib/core-0.17.0.jar:/root/asterinas/ycsb-0.17.0/lib/htrace-core4-4.1.0-incubating.jar:/root/asterinas/ycsb-0.17.0/lib/jackson-core-asl-1.9.4.jar:/root/asterinas/ycsb-0.17.0/lib/jackson-mapper-asl-1.9.4.jar:/root/asterinas/ycsb-0.17.0/redis-binding/lib/commons-pool2-2.4.2.jar:/root/asterinas/ycsb-0.17.0/redis-binding/lib/jedis-2.9.0.jar:/root/asterinas/ycsb-0.17.0/redis-binding/lib/redis-binding-0.17.0.jar site.ycsb.Client -load -db site.ycsb.db.RedisClient -P ./ycsb-0.17.0/workloads/workload-custom -p redis.host=10.0.2.15 -threads 1 -target 1000 -p insertstart=448
[OVERALL], RunTime(ms), 1509
[OVERALL], Throughput(ops/sec), 994.0357852882704
[TOTAL_GCS_PS_Scavenge], Count, 0
[TOTAL_GC_TIME_PS_Scavenge], Time(ms), 0
[TOTAL_GC_TIME_%_PS_Scavenge], Time(%), 0.0
[TOTAL_GCS_PS_MarkSweep], Count, 0
[TOTAL_GC_TIME_PS_MarkSweep], Time(ms), 0
[TOTAL_GC_TIME_%_PS_MarkSweep], Time(%), 0.0
[TOTAL_GCs], Count, 0
[TOTAL_GC_TIME], Time(ms), 0
[TOTAL_GC_TIME_%], Time(%), 0.0
[CLEANUP], Operations, 1
[CLEANUP], AverageLatency(us), 292.0
[CLEANUP], MinLatency(us), 292
[CLEANUP], MaxLatency(us), 292
[CLEANUP], 95thPercentileLatency(us), 292
[CLEANUP], 99thPercentileLatency(us), 292
[INSERT], Operations, 1500
[INSERT], AverageLatency(us), 102.886
[INSERT], MinLatency(us), 34
[INSERT], MaxLatency(us), 2671
[INSERT], 95thPercentileLatency(us), 287
[INSERT], 99thPercentileLatency(us), 366
[INSERT], Return=OK, 1500
./test/benchmark/jre/jre1.8.0_471//bin/java  -classpath /root/asterinas/ycsb-0.17.0/conf:/root/asterinas/ycsb-0.17.0/lib/HdrHistogram-2.1.4.jar:/root/asterinas/ycsb-0.17.0/lib/core-0.17.0.jar:/root/asterinas/ycsb-0.17.0/lib/htrace-core4-4.1.0-incubating.jar:/root/asterinas/ycsb-0.17.0/lib/jackson-core-asl-1.9.4.jar:/root/asterinas/ycsb-0.17.0/lib/jackson-mapper-asl-1.9.4.jar:/root/asterinas/ycsb-0.17.0/redis-binding/lib/commons-pool2-2.4.2.jar:/root/asterinas/ycsb-0.17.0/redis-binding/lib/jedis-2.9.0.jar:/root/asterinas/ycsb-0.17.0/redis-binding/lib/redis-binding-0.17.0.jar site.ycsb.Client -load -db site.ycsb.db.RedisClient -P ./ycsb-0.17.0/workloads/workload-custom -p redis.host=10.0.2.15 -threads 1 -target 1000 -p insertstart=512
[OVERALL], RunTime(ms), 1510
[OVERALL], Throughput(ops/sec), 993.3774834437086
[TOTAL_GCS_PS_Scavenge], Count, 0
[TOTAL_GC_TIME_PS_Scavenge], Time(ms), 0
[TOTAL_GC_TIME_%_PS_Scavenge], Time(%), 0.0
[TOTAL_GCS_PS_MarkSweep], Count, 0
[TOTAL_GC_TIME_PS_MarkSweep], Time(ms), 0
[TOTAL_GC_TIME_%_PS_MarkSweep], Time(%), 0.0
[TOTAL_GCs], Count, 0
[TOTAL_GC_TIME], Time(ms), 0
[TOTAL_GC_TIME_%], Time(%), 0.0
[CLEANUP], Operations, 1
[CLEANUP], AverageLatency(us), 869.0
[CLEANUP], MinLatency(us), 869
[CLEANUP], MaxLatency(us), 869
[CLEANUP], 95thPercentileLatency(us), 869
[CLEANUP], 99thPercentileLatency(us), 869
[INSERT], Operations, 1500
[INSERT], AverageLatency(us), 139.31
[INSERT], MinLatency(us), 37
[INSERT], MaxLatency(us), 2539
[INSERT], 95thPercentileLatency(us), 364
[INSERT], 99thPercentileLatency(us), 501
[INSERT], Return=OK, 1500